{
    "intents": [
    {"tag": "aim",
    "patterns": ["what is physics aim","our aim","aim"],
    "responses": ["The primary focus of this department is to provide a high standard of Undergraduate and Postgraduate education via lectures, tests and exams, tutorials, labs and projects."]
    },
    {"tag": "history",
    "patterns": ["What is the physics department history?", "history"],
    "responses": ["The department of Physics was founded in 1948 when the University was then University College still associated with the University of London.\\n\\nThe department is one of the largest and oldest in the University. In 1969, it primarily catered to the first year Medical students offering preliminary science and premedical courses at the GCE Advanced level. Workshop facilities were limited and separated in single-storey buildings. Only two undergraduate programmes were offered which are the General degree and Special degree programmes. The General degree programme was offered as  evening classes and spanned six (6) years. The graduate research programmes were also quite limited and included Physics of the Upper Atmosphere, Seismology, Biophysics and Computing techniques.\\n\\nCheck our Alumni page to see some of our notable graduates as well as pictures of the old Department and its past activities."]
    },
    {"tag": "overview",
    "patterns": ["overview", "physics overview", "physics department overview"],
    "responses": ["he Department of Physics now has many facilities and offers a wide range of majors. Its facilities include a computer laboratory established in 2006 formally called the Virtual lab, two electronics laboratories, a medical physics lab, a materials science lab, an optics lab and a nuclear lab. See the Facilities page for a description of each.\\n\\nMajors now offered are General Physics, Electronics, Energy and Environmental Physics, Materials Science and Medical Physics.\\n\\nResearch now spans Climate Studies, Renewable Energy, Material Sciences, Medical Physics, Digital Signals Processing and Circuits & Instrumentation."]
    }
    ]
}